{
 "title": "Proposal to handle CMC management",
 "authors": [
  "terra1f6j6jcqjfk3gxg6kfd0v5ht782y625u349kqqz"
 ],
 "summary": "As TFL has listed Terra Classic on CoinMarketCap initially, they still are the only entity holding the keys to access CMC and change links to website, socials and other information.  ",
 "details": "# Proposal to handle CMC management\n\nAs TFL has listed Terra Classic on CoinMarketCap initially, they still are the only entity holding the keys to access CMC and change links to website, socials and other information.  \nDue to the fact that TFL will leave the space in two weeks' time, it is urgently required to gain access to these dashboards and be able to change data through governance consensus.\n\n## The Problem\n\nEntities like CMC only accept change requests through the official channels of the entity who owns the listing. May it be the official email address or official socials.  \nIt is unlikely to ever gain access to the terra.money domain or the official @terra_money X account. Defining new official socials or nominating and voting on an official representative will also not be feasible, especially not inside the given time-span.  \nAfter the socials and website links on CMC were changed through the initiative of an individual without governance decision, this was reverted through opposing entities, both via TFL. This means that CMC currently has no socials or website linked for Terra Classic, making it appear like a dead project.\n\n## The Solution\n\nTo give the community more time to come to an agreement, we propose to ask TFL to hand over access to the CMC dashboard and potential other management dashboards for chain information (e.g. links to websites, social, chain information texts) for Terra Classic to Allnodes as a trusted entity. Allnodes agreed to act as a custodial holder of these access privileges and change links there on behalf of the chain according to governance decisions.  \nThis, in case TFL follows governance, would give us time to come to a decision on how to handle this in the future. Once governance would agree on a new entity to hold these privileges in the future, Allnodes were to hand over access to the new holders.\n\nGiven the time-critical situation, a discussion phase on Commonwealth was skipped and this proposal was put up for vote immediately. We ask for your understanding that a 7+7 day governance phase would have been too long in this case.",
 "proposal_forum_url": "",
 "vote_option_context": "Yes - ask TFL to hand over access to Allnodes, who would act as custodial holders\nNo - don't follow this route\nAbstain - go with the majority vote"
}