{
 "title": "Integrated Ruleset for Secure and Inclusive Terra Classic L1 Development",
 "authors": [
    "terra13avdm9rqxpftv3vrkaqaakakgh30909x8hrruz"
 ],
 "summary": "This proposal aims to address the issues identified in the previously passed KYC proposal (12033) and introduce additional safeguards while ensuring that everyone can contribute to the Terra Classic codebase.",
 "details": "### Introduction\n\nThis proposal aims to address the issues identified in the previously passed KYC proposal (12033) and introduce additional safeguards while ensuring that everyone can contribute to the Terra Classic codebase.\n\n### Contribution Rules for the Terra Classic Codebase:\n\n**Code Contribution:**  \n- **Open Access:** There are no restrictions on who is allowed to contribute code. Anyone can submit code changes via a Pull Request (PR). However, non-KYCed contributors are not permitted to directly commit code to the classic-terra repositories.\n\n**Code Review and Commentary:**  \n- **Open Participation:** There are no restrictions on who is allowed to review or comment on code contributions. This is already the case under the current KYC rules and is just added here for clarification.\n\n**Merging and Release Management:**  \n- **Governance-Controlled Access:** Merging code into the Terra Classic repository (which includes all repositories within the classic-terra GitHub organization) and creating releases can only be performed by individuals from a governance-approved list.\n- **Dynamic List Management:** This list of authorized individuals can be updated (expanded or reduced) at any time via governance decisions. The initial list of authorized individuals consists of (in alphabetical order):\n\nAnh Minh (GenuineLabs)  \nDong (GenuineLabs)  \nexpertdicer (GenuineLabs)  \nFragwuerdig  \nRenzo  \nStrathCole  \nVinh  \n\n### KYC Requirements\n\nOnly governance-passed KYC providers will be recognized for this process. To add an additional 3rd-party KYC provider, it has to be approved via a governance proposal. Current governance-approved KYC providers are:\n- CertiK\n- solidproof.io\n\nThis proposal supersedes contribution-rules from previous passed KYC-related proposals.",
 "proposal_forum_url": "https://commonwealth.im/terra-luna-classic-lunc/discussion/24583-integrated-ruleset-for-secure-and-inclusive-terra-classic-l1-development",
 "vote_option_context": "Yes: I agree with the outlined rules  \n\nNo: I want to keep the current rules in place  \n\nAbstain: I just contribute to the quorum  \n\nVeto: I consider this proposal harmful and deposit should be burnt"
}