{
 "title": "Implement a Simplified Tax Handling on Terra Classic",
 "authors": [
  "terra1f6j6jcqjfk3gxg6kfd0v5ht782y625u349kqqz"
 ],
 "summary": "Implement a backwards compatible tax handling mechanism on Terra Classic to simplify tax handling and replace the tax2gas approach.",
 "details": "## Summary\n\nThis proposal seeks approval to deploy the \"Reverse Charge\" mechanism on Terra Classic and replace the tax2gas approach. The Reverse Charge solution simplifies tax handling by automatically deducting tax from the amount sent before it reaches the recipient's wallet, eliminating the need for the sender to pay the tax as an additional fee. The system retains full backward compatibility and offers developers an option to still use sender-side taxation for fund transfers if desired. The approach also solves the double taxation issue on contracts that is present in the current system.\n\n## Motivation\n\nThe existing tax system on Terra Classic requires the sender to cover tax fees on top of gas, which has been a significant development burden for dApps, particularly those originating from other ecosystems. To alleviate this, the proposed system was developed, automatically handling tax deductions on the blockchain itself. This eliminates the need for dApp developers to implement complex tax-handling logic in contracts or dApp interfaces.\n\n## Status of Development\n\nThe solution has already been fully developed. During testing on a local system and the secondary testnet, the Reverse Charge approach has caused no issues on dApps. Tests were conducted with UIs handling tax and UIs not handling tax as well as using the command line terrad client. The solution provides a significant improvement in usability for both developers and users. Furthermore, it eliminating double taxation on contracts.\n\nThe tax2gas proposal, although previously approved, is rendered unnecessary by this new solution.\n\n## Changes\n\nThe implementation of Reverse Charge introduces the following key modifications:\n\n* Automatic Tax Deduction:  \n  Tax by default is deducted from the sent amount, removing the need for the sender to make sure to send enough fees.\n* Backward Compatibility:  \n  dApps can still choose to allow the sender to cover the tax on normal fund transfers if desired, ensuring full backward compatibility with existing systems.\n* Contract Interaction:\n  In case dApps continue to let the sender pay tax when interacting with contracts, these funds are automatically refunded to ensure a consistent and fair taxation process\n* Elimination of Double Taxation:  \n  Contracts will no longer be taxed when receiving funds; taxation will only occur when funds are sent out to a wallet.\n* Tax2Gas Obsolescence:  \n  This solution replaces the need for the tax2gas approach, resolving the concerns and complexities associated with that model.\n* Whitelisting:\n  Existing whitelisting mechanisms remain intact (i.e., for Binance wallets). It is desired to implement a more fine-grained whitelisting feature under governance control via \"tax zones\" in a future update. The proposed implementation of tax handling is fully compatible with that.\n* Wallet Compatibility  \n  Wallets like Keplr, Station and others are expected to continue to work without changes. Local tests emulating the process used by these wallets have shown no issues.\n\n## Testing and Deployment\n\nThe system was fully developed and has been successfully deployed on the secondary testnet. Tests were conducted on various transaction types, including sending LUNC, NFT collection deployment, and buying NFTs via UI. In all cases, tax deductions worked as intended, with both backward-compatible and new tax query methods functioning seamlessly.\n\nFurther testing will focus on additional use cases, e.g. voting on proposals. Participation of users and dApps in these tests is encouraged. If this proposal is approved, the remaining tasks listed below will be completed and the system will be prepared for mainnet deployment through a software upgrade proposal.\n\nThe following tasks remain to be completed:\n\n* Deployment on primary rebel-2 testnet\n* Further use-case testing on the testnet\n* Fixing interchain tests introduced in SDK 0.47\n* Preparing the release for mainnet deployment\n* Review by another developer or team\n\n## Cast Your Vote",
 "proposal_forum_url": "https://commonwealth.im/terra-luna-classic-lunc/discussion/25158-implement-a-simplified-tax-handling-on-terra-classic",
 "vote_option_context": "Yes: Approve the implementation of Reverse Charge, simplifying tax handling and replacing tax2gas.  \nNo: Reject the proposal and maintain the current tax system, with potential for future tax2gas deployment.  \nAbstain: You have no strong opinion and will accept the majority's decision.  \nVeto: You believe this proposal is harmful and should not be implemented."
}