{
 "title": "Upgrade to v3.3.0",
 "authors": [
  "terra13avdm9rqxpftv3vrkaqaakakgh30909x8hrruz"
 ],
 "summary": "This proposal, if passed, will upgrade the network to v3.3.0 which introduces a changed and simplified tax handling.",
 "details": "### Release v3.3.0\n\nA new release of the `terrad` client has been created on the 3rd of December 2024. The release notes for the new version can be viewed here:\n\nhttps://github.com/classic-terra/core/releases/tag/v3.3.0\n\nThis release introduces a new simplified tax handling. Details on the new tax handling can be found in the original proposal https://github.com/classic-terra/documents/blob/main/proposals/tax_proposal.md the technical release notes can be found at https://github.com/classic-terra/documents/blob/main/chain-updates/v3_3_0.md\n\n### Proposal\n\nThis proposal seeks validator and community approval to update the `terrad` client to `v3.3.0` (upgrade name `v10_1`). The chain will be halted at **block height 21163600**  which will approximately be processed on **Dec 17, 2024, 12:57:47 UTC**. The actual halt time is an early estimate, can vary and depends on the chain's block speed until the specified height is reached. Upon passing of this proposal, an automatic chain halt will be scheduled at the specified height. The validators are going to be asked to install the new version of the `terrad` client after the chain halt occured.\n\n### Upgrade Instructions for Validators\n\nAs soon as the chain automatically halts at the designated upgrade block height follow the upgrade procedure. Please **don't execute these commands before the chain has halted**:\n\n```bash\n$ git clone https://github.com/classic-terra/core core-v3.3.0\n$ cd core-v3.3.0\n$ git checkout v3.3.0\n$ make build && make install \n```\n\nIn case you already have a local copy of the repository inside the local folder `core`:\n\n```bash\n$ cd core\n$ git stash\n$ git fetch --all\n$ git fetch --tags\n$ git checkout v3.3.0\n$ make build && make install\n```\n\nCheck the correct installation:\n\n```bash\n$ terrad version\nv3.3.0\n```\n\nAfter that, restart the client with `terrad start` or your system service and wait for consensus. During that period, **don't restart the client if not otherwise asked to do so**.\n\n### Infrastructure Providers\n\nInfrastructure providers who run mantlemint accelerated LCDs are asked to build and install the updated mantlemint version from source after the upgrade block height is reached:\n\nhttps://github.com/classic-terra/mantlemint/releases/tag/v3.3.0\n\n### Testing and Rollback\n\nAn upgrade to `v3.3.0` release candidate was conducted on rebel-2 testnet on 7th of November 2024 and the changes were tested extensively. If for some unforeseen (and unlikely) reason the new release will not be able to produce new blocks on mainnet then the upgrade name `v10_1` can be applied to the previous release `v3.1.6`. In this case validators are going to be asked to roll back to a previous state and apply a patched `v3.1.6` release.\n\n### Effects of Voting",
 "proposal_forum_url": "",
 "vote_option_context": "- **YES** - you agree to schedule an upgrade to v3.3.0\n- **NO** - you don't agree to schedule an upgrade to v3.3.0\n- **ABSTAIN** - you want the proposal to reach quorum and align with the majority vote\n- **VETO** - you strongly disagree and want the prop to fail with a 33,33% veto threshold"
}
